{
	"name": "Merriam-Webster Dictionary",
	"description": "<p><span>The Merriam-Webster Dictionary API gives developers access to a comprehensive resource of dictionary and thesaurus content as well as specialized medical, Spanish, ESL, and student-friendly vocabulary. Make your applications better by integrating our authoritative definitions, etymologies, audio pronunciations, synonyms and antonyms, and more. Our robust API empowers developers to enhance word games and create educational, language learning, and other word-related applications for the digital environment. We look forward to seeing all of the new, innovative products powered by Merriam-Webster's trusted references.</span></p>",
	"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/dev-center-logo-500x100.png",
	"tags": ["dictionary",
	"language",
	"stack",
	"thesaurus",
	"translation"],
	"created": "2014-12-31",
	"modified": "2014-12-31",
	"url": "http://theapistack.com/merriamwebster-dictionary/apis.json",
	"specificationVersion": "0.14",
	"apis": [{
		"name": "Merriam-Webster Dictionary",
		"description": "Merriam-Webster has been producing language informationu00e2u0080u0094including dictionaries, thesauri, and translation materialsu00e2u0080u0094for over 150 years. The Merriam-Webster collection of APIs provide developer access to a variety of the companyu00e2u0080u0099s most prominent reference works. Free access is provided to non-commercial websites and applications. Free access is limited to two reference works with a maximum of 1000 queries a day per reference work. Full access is available for commercial use.",
		"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/dev-center-logo-500x100.png",
		"humanURL": "http://dictionaryapi.com/",
		"baseURL": "http://dictionaryapi.com/",
		"tags": ["dictionary",
		"language",
		"payments",
		"thesaurus",
		"translation"],
		"properties": [{
			"type": "X-branding",
			"url": "http://dictionaryapi.com/info/branding-guidelines.htm"
		},
		{
			"type": "X-webinars",
			"url": "http://dictionaryapi.com/"
		}],
		"contact": [{
			"FN": "Merriam-Webster Dictionary"
		}]
	}],
	"maintainers": [{
		"FN": "Kin",
		"X-twitter": "apievangelist",
		"email": "kin@email.com"
	}]
}