{
	"name": "API2Cart",
	"description": "<p>Since 2001, MagneticOne has been an innovative software development company providing full-cycle services for your eCommerce. MagneticOne products help online merchants from the ends of the earth to make more revenue. Company provides a number of eCommerce solutions for effective store management, SEO and marketing automation, comparison shopping engines for eCommerce platforms. MagneticOne company is an expert in software development offering a well-balanced blend of technology skills, hand-on experience and passion to IT.</p>",
	"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/api-2-cart.png",
	"tags": ["aggregation",
	"e-commerce",
	"shopping cart"],
	"created": "2014-12-31",
	"modified": "2014-12-31",
	"url": "http://theapistack.com/api2cart/apis.json",
	"specificationVersion": "0.14",
	"apis": [{
		"name": "API2Cart",
		"description": "API2Cart provides a unified shopping cart interface to provide customers with eCommerce integration. It allows users to perform API methods for 20+ popular shopping platforms with older and new cart versions. API2Cart takes care of secure data retrieval from multiple stores. Public documentation and code samples are available for developers to optimize work with API. API methods include order, category and product management. The service allows to add, update, find, delete store items and perform cart management methods. Specific integration requirements can be discussed via e-mail: business@api2cart.com Users can register and try service functionality for free using API2Cart Demo store.",
		"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/api-2-cart.png",
		"humanURL": "https://api2cart.3scale.net/docs",
		"baseURL": "https://api2cart.3scale.net/docs",
		"tags": ["e-commerce",
		"retail",
		"shopping",
		"shopping cart"],
		"properties": [{
			"type": "X-portal",
			"url": "https://api2cart.3scale.net/"
		},
		{
			"type": "X-email",
			"url": "business@api2cart.com"
		},
		{
			"type": "X-twitter",
			"url": "https://twitter.com/api2cart"
		},
		{
			"type": "X-webinars",
			"url": "https://www.api2cart.com/"
		}],
		"contact": [{
			"FN": "API2Cart",
			"email": "business@api2cart.com",
			"X-twitter": "https://twitter.com/api2cart"
		}]
	}],
	"maintainers": [{
		"FN": "Kin",
		"X-twitter": "apievangelist",
		"email": "kin@email.com"
	}]
}