{
	"name": "Xignite",
	"description": "Xignite is the leading financial market data cloud provider, offering more than 50 financial cloud APIs and fulfilling more than five billion service requests per month for real-time, historical and reference data covering global equities, commodities, currencies, options, fixed income, mutual funds, derivatives and OTC instruments. The Xignite market data cloud powers mission-critical applications for financial services front, middle and back office, financial websites, investor relations, corporate ERP and BI, e-commerce, and mobile for more than 900 clients in 47 countries, including Citi, GE, Wells Fargo, ING, BNY Mellon, Natixis, Forbes.com, SeekingAlpha, ExxonMobil, Starbucks, Netsuite, and Barrick Gold. The award-winning XigniteOnDemand cloud platform also provides new online channels for stock exchanges, trading venues, OTC brokers and market data originators including CME Group, NASDAQ OMX, BGCantor and Pearson. For more information, please visit www.xignite.com or call 1-866-XML-SOAP.",
	"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
	"x-open-ranking": "0",
	"tags": [
		"API-Stack"
	],
	"created": "2016-04-20",
	"modified": "2016-04-20",
	"url": "http:\/\/theapistack.com\/data\/xignite\/apis.json",
	"specificationVersion": "0.14",
	"apis": [
		{
			"name": "Xignite BATSLastSale",
			"description": "XigniteBATSLastSale provides real-time BATS last sale prices for U.S. equities including open, close, high, low and volume stock data traded on NASDAQ, NYSE, NYSE Alternext and over-the-counter exchanges. BATS operates two stock exchanges in the U.S., the BZX Exchange and the BYX Exchange (The BATS Exchanges), which currently account for about 11-12% of all U.S. equity trading on a daily basis.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xBATSLastSale.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xBATSLastSale.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "Xignite Calendar",
			"description": "This web service provides global economic calendars of scheduled Treasury and economic events and announcements. With XigniteCalendar, you can easily keep track of scheduled Treasury and economic events and announcements in the U.S. and major industrialized countries such as France, Australia, Japan, Germany, Canada, Italy, and the United Kingdom.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/preview.xignite.com\/xcalendar.asmx",
			"baseURL": "http:\/\/preview.xignite.com\/xcalendar.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "Xignite Global Historical",
			"description": "This web service provides global historical stock quotes and closing prices for U.S. and international equities dating back to 1994 and 2000, respectively. XigniteGlobalHistorical currently provides global stock quotes from over 120 stock exchanges in ninety countries outside the U.S. This global stock quotes web service covers stock exchanges in major financial markets as well as those in emerging markets. Below is a partial list of country coverage of XigniteGlobalHistorical:",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/preview.xignite.com\/xglobalhistorical.asmx",
			"baseURL": "http:\/\/preview.xignite.com\/xglobalhistorical.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "Xignite Index Components",
			"description": "You can use XigniteIndexComponents to get the list of securities and weightings that comprise the stock indices. Also known as index constituents, index composition, or index memberships, index component is the information about the securities that are included in the calculations of an index. Index calculations can be straightforward, i.e. the sum of the price of all the securities in the index or can involve more complex calculations and weightings. Commonly used index calculations are market-value weighted index, such as the NASDAQ Composite (^IXIC), and price-weighted index such as the Dow Jones Industrial Average (^DJI).",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xIndexComponents.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xIndexComponents.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteAnalysts",
			"description": "\nThis web service provides comprehensive information on analyst stock recommendations and ratings for U.S. stocks.\nXigniteAnalysts gives you detailed information and statistics on analyst recommendations and their revision trends.\nXigniteAnalysts provides all the up-to-date data you need for your stock research and fundamental analysis. Some examples of stock recommendations data provided by this web service include consensus recommendations, number of analysts with recommendations, and upgrades and downgrades trends.\nWith XigniteAnalysts, you can get analyst stock recommendations fully integrated into your applications, giving you instant access to financial data to automate your critical business process",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/preview.xignite.com\/xanalysts.asmx",
			"baseURL": "http:\/\/preview.xignite.com\/xanalysts.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteBATSRealTime",
			"description": "Provides real-time BATS Exchange stock prices and trade data for US-listed stocks traded on NASDAQ, NYSE, AMEX and OTC exchanges including last sale, bid\/ask prices, intraday stock charts, trading volume, and recent tick-by-tick, open, high, low, and close prices for companies listed on U.S. stock exchanges, including NASDAQ, NYSE, NYSE Alternext, and over-the-counter exchanges. The API uses REST, SOAP protocols and XML data formats",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/xignite.com\/Product\/BATS-real-time-stock-quotes-data\/",
			"baseURL": "http:\/\/xignite.com\/Product\/BATS-real-time-stock-quotes-data\/",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteBondMaster",
			"description": "Provides instrument master detail and supporting reference data for more than 450,000 US Corporate, Treasury, and Agency active and mature bonds. Coverage includes bond master detail, as well as, issue conditions, interest, payment, conversion, and call\/redemption data. API uses REST and SOAP protocols and XML data format.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/xignite.com\/xBondMaster.asmx",
			"baseURL": "http:\/\/xignite.com\/xBondMaster.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteBonds",
			"description": "The Bonds service provides price data for more than 200,000 U.S. corporate and agency bonds. Developers can power their applications with up-to-date U.S. corporate and agency bond price information. Bond Price and Yield Data includes all the details such as Last Trade, Daily and Yearly Open\/High\/Low, Volume, Accrued Interest, Yield to Maturity, Convexity to Maturity. The API uses REST and SOAP calls and responses are formatted in XML.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/xignite.com\/xBonds.asmx",
			"baseURL": "http:\/\/xignite.com\/xBonds.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteBondsRealTime",
			"description": "The Bonds Real-Time service provides real-time price and yield data for more than 200,000 U.S. corporate and agency bonds. The service includes all of the real-time bond detail including last trade, daily and yearly open\/high\/low, volume, accrued interest, yield to maturity, and convexity to maturity. The API uses REST and SOAP calls and responses are formatted in XML.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/xignite.com\/xBondsRealTime.asmx",
			"baseURL": "http:\/\/xignite.com\/xBondsRealTime.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteCharts",
			"description": "XigniteChart provides historical stock charts for U.S. equities, including line, candle, stick, area and percent chart types for both stock prices and market capitalization of companies listed on U.S. stock exchanges, including NASDAQ, NYSE, NYSE Alternext, and over-the-counter exchanges. Both quick-to-create standard and highly tailorable custom charts are available. Custom charts allow detailed branding and data presentation by controlling backgrounds, colors, titles, legends, gridlines, tick-precision and the inclusion of ancillary data elements such as high, low, open and close price lines and trading volume.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xChart.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xChart.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteCompensation",
			"description": "\nThis web service provides executive pay and compensation for U.S. publicly listed companies. XigniteCompensation currently provides compensation data on corporate officers and directors, including salaries, cash compensation, option grants, other stock-related compensation and auditor fees, as reported in the Annual Meeting Proxy Statements or Form 10-K filed with the SEC. Officers compensation data are updated daily within 30 days of filings with the SEC.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xCompensation.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xCompensation.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteCorporateActions",
			"description": "The Corporate Actions service provides current and historic corporate actions data for securities traded on global exchanges. The data that can be accessed includes Mergers & Acquisitions activities, dividend distributions, stock splits, master record changes, and more. This data can be integrated with third party applications. The API uses REST and SOAP calls and responses are formatted in XML.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/xignite.com\/xCorporateActions.asmx",
			"baseURL": "http:\/\/xignite.com\/xCorporateActions.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteCurrencies",
			"description": "Start pulling live forex data into your application or website in a matter of minutes with XigniteCurrencies, a high-performance web service delivering global currency data for over 140 countries, including real-time exchange rates, tick-by-tick rates, historical data and interactive charts.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/preview.xignite.com\/xCurrencies.asmx",
			"baseURL": "http:\/\/preview.xignite.com\/xCurrencies.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteEarningsCalendar",
			"description": "The Earnings Calendar web service provides corporate events and earnings calendar information for 5,000 publicly listed U.S. and Canadian companies and ADRs. XigniteEarningsCalendar provides visibility into scheduled corporate events that represent opportunities to manage risk and profit from volatility. Earnings Calendar data includes: Timing of earnings announcements, Conference call dates, times, and links, Earnings calendar with 89-day forward looking window and more. The API uses REST and SOAP calls and responses are formatted in XML.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/xignite.com\/xEarningsCalendar.asmx",
			"baseURL": "http:\/\/xignite.com\/xEarningsCalendar.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteEdgar",
			"description": "This web service provides corporate information available in the U.S. SEC’s Edgar database. You can use XigniteEdgar to quickly research a company’s financial information and operations by reviewing registration statements, prospectuses and periodic reports filed on Forms 10-K and 10-Q. XigniteEdgar is ideal for investors performing investment (stock and bond) research and analysis on U.S. listed companies.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/preview.xignite.com\/xEdgar.asmx",
			"baseURL": "http:\/\/preview.xignite.com\/xEdgar.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteEmerging",
			"description": "This web service provides government bond prices and yields for emerging markets around the world.  With XigniteEmerging, you can get all the emerging market bond rates fully integrated into your applications, giving you instant access to market data and information to automate your critical business processes.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xEmerging.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xEmerging.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteEnergy",
			"description": "This web service provides delayed and historical energy futures quotes and prices from major commodity exchanges.  XigniteEnergy is a complete solution designed to address your energy pricing needs. Click here for more information.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xEnergy.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xEnergy.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteEstimates",
			"description": "This web service provides comprehensive information on analyst earnings estimates for U.S. stocks.  For each company stock, you can get 400 – 500 related data compiled on earnings estimates, giving you detailed information and statistics to analyze sales and earnings forecasts, revision trends, and company earnings growth rates.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/preview.xignite.com\/xestimates.asmx",
			"baseURL": "http:\/\/preview.xignite.com\/xestimates.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteExchanges",
			"description": "This web service provides business operating hours for securities exchanges around the world.  XigniteExchanges provides operating information such as exchange holidays, trading days and hours, and settlement rules for major stock and bond exchanges in the global financial markets.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xExchanges.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xExchanges.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteFinancials",
			"description": "This web service provides financial statements and ratios for companies listed on U.S. and Canadian exchanges.  XigniteFinancials offers financial statements since 1994, when applicable, with full coverage of companies listed on NYSE, NASDAQ and AMEX, and partial coverage for OTCBB and Pinksheets. This web service is ideal for performing stock fundamental research and investment analysis on U.S. and Canadian companies.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/preview.xignite.com\/xfinancials.asmx",
			"baseURL": "http:\/\/preview.xignite.com\/xfinancials.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteFundamentals",
			"description": "This web service API provides company fundamentals data for U.S. and Canadian listed companies.  XigniteFundamentals provides broad fundamental data coverage on more than four hundred fundamental data points. This API is ideal for equity research, equity analysis, and publication of key company data on websites.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/preview.xignite.com\/xfundamentals.asmx",
			"baseURL": "http:\/\/preview.xignite.com\/xfundamentals.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteFundData",
			"description": "This web service provides detailed U.S. mutual fund data and information, including fund facts and performances.  You can use XigniteFundData to get comprehensive information on mutual fund facts and performances, such as registration, asset size, historical performances, fees and expenses, and financial statements. This web service is ideal for investors performing investment research and analysis.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/preview.xignite.com\/xfunddata.asmx",
			"baseURL": "http:\/\/preview.xignite.com\/xfunddata.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteFundHoldings",
			"description": "This web service provides mutual fund holdings disclosure filed by US registered funds companies.  By U.S. securities law, mutual funds are required to disclose portfolio holdings by filing quarterly reports with the SEC. In these filings, mutual funds are required to list the securities they hold and for what amount. This web service provides a data feed to access all portfolio holdings information filed by U.S. mutual funds. It is updated daily within 30 days of filing.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xFundHoldings.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xFundHoldings.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteFunds",
			"description": "\nThis web service provides historical and daily end-of-day closing NAVs (Net Asset Values) for U.S. and Canadian mutual funds.\nYou can use XigniteFunds to get accurate daily mutual fund prices (NVAs) for pricing of investment portfolios and for research and analysis of mutual fund performances. With XigniteFunds, you can get all the U.S. mutual fund NAVs fully integrated into your applications, giving you instant access to market data to automate your critical business processes.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/preview.xignite.com\/xFunds.asmx",
			"baseURL": "http:\/\/preview.xignite.com\/xFunds.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteFutures",
			"description": "This web service provides delayed futures price quotes from major commodity exchanges.  With XigniteFutures, you can get all the exchange traded commodity futures price quotes integrated into your applications, giving you instant access to market data to automate your critical trading, hedging, and investment research and analysis processes.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/preview.xignite.com\/xFutures.asmx",
			"baseURL": "http:\/\/preview.xignite.com\/xFutures.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteGlobalBondMaster",
			"description": "Xignite Global Bond Master provides basic master detail for more than 350,000 European and Asian corporate bonds. The service includes all the basic corporate issue detail including issuer name, coupon rate, maturity date, sector, currency, issuer name and more. The API uses REST and SOAP calls and responses are formatted in XML.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/xignite.com\/xGlobalBondMaster.asmx",
			"baseURL": "http:\/\/xignite.com\/xGlobalBondMaster.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteGlobalFundamentals",
			"description": "The GlobalFundamentals web service provides stock fundamentals for a large universe of globally listed public companies. Users can query the service to return data including Corporate information, Shares Outstanding, Market Capitalization, Earnings Per Share, Price Earning Ratio and more. Users can look up fundamentals of a globally listed company either by its symbol, CUSIP, ISIN, or Valoren. Data is updated daily. The API uses REST and SOAP calls and responses are formatted in XML.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/xignite.com\/xGlobalFundamentals.asmx",
			"baseURL": "http:\/\/xignite.com\/xGlobalFundamentals.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteGlobalNews",
			"description": "Xignite is the leading financial market data cloud provider, offering more than 50 financial cloud APIs and fulfilling more than five billion service requests per month for real-time, historical and reference data covering global equities, commodities, currencies, options, fixed income, mutual funds, derivatives and OTC instruments. The Xignite market data cloud powers mission-critical applications for financial services front, middle and back office, financial websites, investor relations, corporate ERP and BI, e-commerce, and mobile for more than 900 clients in 47 countries, including Citi, GE, Wells Fargo, ING, BNY Mellon, Natixis, Forbes.com, SeekingAlpha, ExxonMobil, Starbucks, Netsuite, and Barrick Gold. The award-winning XigniteOnDemand cloud platform also provides new online channels for stock exchanges, trading venues, OTC brokers and market data originators including CME Group, NASDAQ OMX, BGCantor and Pearson. For more information, please visit www.xignite.com or call 1-866-XML-SOAP.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/product\/company-financial-news\/api\/GetHistoricalMarketHeadlines\/",
			"baseURL": "http:\/\/www.xignite.com\/product\/company-financial-news\/api\/GetHistoricalMarketHeadlines\/",
			"tags": [
				"API-Stack"
			],
			"properties": [
				{
					"type": "x-openapi-spec-json",
					"url": "http:\/\/theapistack.com\/data\/xignite\/xigniteglobalnews-openapi-spec.json"
				},
				{
					"type": "x-openapi-spec-yaml",
					"url": "https:\/\/github.com\/api-stack\/api-stack\/blob\/gh-pages\/_data\/xignite\/xigniteglobalnews-openapi-spec.yaml"
				}
			]
		},
		{
			"name": "XigniteGlobalQuotes",
			"description": "Start pulling delayed stock prices into your applications right away with XigniteGlobalQuotes. This high-performance web service API gives you the flexibility to integrate stock quotes into different applications to meet the specific needs of your business and industry.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/preview.xignite.com\/xGlobalQuotes.asmx",
			"baseURL": "http:\/\/preview.xignite.com\/xGlobalQuotes.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteGlobalRealTime",
			"description": "The Global RealTime Stock Quotes web service provides real-time stock quotes for equities listed on international exchanges in several Scandinavian countries. Data returned includes name, ticker symbol, date, time, closing price and more. The API uses REST and SOAP calls and responses are in XML.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/xignite.com\/xGlobalRealTime.asmx",
			"baseURL": "http:\/\/xignite.com\/xGlobalRealTime.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteHistorical",
			"description": "XigniteHistorical provides historical stock quote information for U.S. equities, including high, low, open and close prices for companies listed on U.S. stock exchanges, including NASDAQ, NYSE, NYSE Alternext, and over-the-counter exchanges. In addition to historical stock quotes, the service also provides volume, dividend and split data as well as top movers, gainers and losers.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xHistorical.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xHistorical.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteHoldings",
			"description": "This web service provides securities holdings filed by institutional investment managers. While institutional holding information is commonly available on investor portals, this information is typically limited to the top few holders. You can use XigniteHoldings to get a complete list of institutional holders of a security as of a specific date, and search holdings information by money manager.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xHoldings.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xHoldings.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteHousing",
			"description": "This web service provides economic statistics on the housing markets in the United States.Housing statistics are often used as economic indicators of the supply, demand, activities and growth of the U.S. residential real estate markets. XigniteHousing includes housing statistics such as home sales and prices by regions, housing inventory and affordability, housing starts, mortgage applications, monthly permits issued, home sales index and others compiled by the National Association of Realtors. With XigniteHousing, you can get all the U.S. housing market statistics fully integrated into your applications, giving you instant access to financial data to automate your critical business processes.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xHousing.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xHousing.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteIndices",
			"description": "Historical and end-of-day closing stock indices are typically available from 1994 onward or from the index inception. Some older historical values are also available. If you need older historical index values or closing values for other indices, please contact us. Historical and end-of-day index data is typically not fee-liable. Dow Jones Indices does require reporting of firms receiving end-of-day access to Dow Jones index values. Volume information is available on some indices only.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xIndices.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xIndices.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteInsider",
			"description": "The US SEC requires corporate insiders, meaning a company's officers and directors, and any beneficial owners of more than ten percent of a class of the company's equity securities, file with the SEC a statement of ownership regarding those securities. XigniteInsider provides corporate insider transactions, value of current ownerships, changes in ownerships and detailed transaction history in a company’s securities by corporate insiders. You can query SEC insider filings by symbol or CUSIP, search insiders by names and addresses, and cross-reference insider transactions across multiple firms.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xInsider.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xInsider.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteInterBanks",
			"description": "XigniteInterBank delivers daily and historical interbank offered and deposits rates for more than 30 countries through web services. LIBOR web service is updated daily based on the rates published by BBA (British Bankers Association) and are available in all LIBOR-quoted currencies GBP, USD, EUR, CAD, JPY, CHF, DKK, AUD, NZD, and SEK.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/preview.xignite.com\/xinterbanks.asmx",
			"baseURL": "http:\/\/preview.xignite.com\/xinterbanks.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteLogos",
			"description": "\nThis web service provides company logos for around 70% of companies listed on NASDAQ, NYSE, and AMEX.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xLogos.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xLogos.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteMaster",
			"description": "This web service API provides timely and accurate security master data for listed securities from over 150 global markets and exchanges. With comprehensive and detailed cross reference data, this API enables you to validate company names, ticker symbols, company identifiers, industry classifications, exchange listings, and more for stock exchanges in major financial markets as well as those in emerging markets. This API is ideal for regulatory and reporting purposes and maintaining up-to-date global security records.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xMaster.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xMaster.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteMetals",
			"description": "Power your application or website with live metal data in minutes using XigniteMetals, a premium web service delivering real-time metal data for gold, silver, platinum and many other metals, covering spot prices, future contracts, historical trend data and more. ",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/preview.xignite.com\/xmetals.asmx",
			"baseURL": "http:\/\/preview.xignite.com\/xmetals.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteMoneyMarkets",
			"description": "This web service provides real-time and historical US Treasury and LIBOR-based swap and forward rates. The U.S. Treasury data provides real-time treasury prices and yields for various maturities of T-Bills, T-Notes and T-bonds. Swap rates data include rate quotes and yields for OTC LIBOR-based interest rate swaps in all traded currencies. You can also use XigniteMoneyMarkets to chart US Treasury and swap yield curves for easy viewing and comparisons.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/preview.xignite.com\/xmoneymarkets.asmx",
			"baseURL": "http:\/\/preview.xignite.com\/xmoneymarkets.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteNASDAQLastSale",
			"description": "XigniteNASDAQLastSale provides real-time NASDAQ last sale stock prices for U.S. equities traded on NASDAQ, NYSE, NYSE Alternext and over-the-counter exchanges. These high quality last sale stock prices from the largest U.S. stock exchange by volume are offered for public display on the Web under specially designed and priced redistribution agreements from NASDAQ.\n",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xNASDAQLastSale.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xNASDAQLastSale.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteNews",
			"description": "This web service delivers comprehensive market news which includes U.S. financial, economic and business news. XigniteNews provides top market news, market headlines, briefings, full stories and securities related news for the U.S. financial markets from authoritative sources such as Reuters, AP, Market Watch, WSJ Online, The Street.com, and many others. You can use XigniteNews to stay informed on the latest breaking news and market developments that affect the U.S. financial markets, economy and business activities.  With XigniteNews, you can get all the U.S. financial and market news fully integrated into your applications, giving you instant access to financial data and information to automate your critical business processes",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xNews.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xNews.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteOFAC",
			"description": "The XigniteOFAC API gives you access to the Specially Designed Nationals (SDN) List for U.S. OFAC Compliance. You can search by name, address and more.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xOFAC.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xOFAC.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteOptions",
			"description": "This web service API provides delayed price quotes for U.S. and international exchange traded equity options. XigniteGlobalOptions API gives you the flexibility to integrate option prices into different applications to meet the specific needs of your business and industry.\n",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/preview.xignite.com\/xoptions.asmx",
			"baseURL": "http:\/\/preview.xignite.com\/xoptions.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteOutlook",
			"description": "This web service provides daily summary and highlights of U.S. financial, market and economic news and events. XigniteOutlook is available daily on a U.S. trading day and provides an easy way for investors and business professionals to get a quick summary of market moving news and economic events for the U.S. financial markets.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xOutlook.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xOutlook.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteQuotes",
			"description": "XigniteQuotes provides 15 minute delayed stock quote data for U.S. equities, including last sale, bid and ask prices for companies listed on U.S. stock exchanges, including NASDAQ, NYSE, NYSE Alternext, and over-the-counter bulletin board and pink sheets. In addition to delayed stock quotes, the service also provides intraday stock charts, recent tick-by-tick, open, high, low, and close prices, volume, market capitalization, earnings, news, market summaries, and top movers, gainers and losers.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xQuotes.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xQuotes.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteRates",
			"description": "This web service provides current and historical benchmark interest rates from global financial markets in the U.S., Europe, Canada and Asia.\nKey interest rates include U.S. H15 Rates, state rates, and Canada Treasury rates. XigniteRates currently support the following commonly quoted interest rates:",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/preview.xignite.com\/xRates.asmx",
			"baseURL": "http:\/\/preview.xignite.com\/xRates.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteRealTimeOptions",
			"description": "The RealTimeOptions web service provides real-time price quotes for U.S. and international exchange traded options including equity, index and currency. Data provided by the service includes full information about securities, quotes and expirations. The API uses REST and SOAP calls and responses are formatted in XML.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/xignite.com\/xRealTimeOptions.asmx",
			"baseURL": "http:\/\/xignite.com\/xRealTimeOptions.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteReleases",
			"description": "This web service delivers real-time and historical company news and press releases for U.S.-listed companies.  You can use XigniteReleases to get company press releases, including corporate and industry news, earnings announcements and projections, dividends, mergers and acquisitions, joint ventures, research analyst coverage, and more.  With XigniteReleases, you can get all the company press releases and news fully integrated into your applications, giving you instant access to financial news to automate your critical business processes.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "https:\/\/www.xignite.com\/product\/XigniteReleases\/api\/",
			"baseURL": "https:\/\/www.xignite.com\/product\/XigniteReleases\/api\/",
			"tags": [
				"API-Stack"
			],
			"properties": [
				{
					"type": "x-openapi-spec-json",
					"url": "http:\/\/theapistack.com\/data\/xignite\/xignitereleases-openapi-spec.json"
				},
				{
					"type": "x-openapi-spec-yaml",
					"url": "https:\/\/github.com\/api-stack\/api-stack\/blob\/gh-pages\/_data\/xignite\/xignitereleases-openapi-spec.yaml"
				}
			]
		},
		{
			"name": "XigniteScreener",
			"description": "The Screener web service allows users to screen more than 10,000 U.S. and Canadian equities based on over 200 criteria as well as search on any combination of parameters. Users get access to pre-market and post-market data and behavior. They can also look up books of orders. The API uses REST and SOAP calls and responses are formatted in XML.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/xignite.com\/xScreener.asmx",
			"baseURL": "http:\/\/xignite.com\/xScreener.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteStatistics",
			"description": "This web service provides access to more than 1,400 economic statistics time-series on the U.S. Economy.You can access economic statistics time-series raw or charted and you can query it for any date range. Economic statistics are organized by category which can be listed using GetCategories. Each category contains multiple topics which can be listed using GetTopics. All other operations provide flexible ways to access the data and charts.\nWith XigniteStatistics, you can get all the U.S. economic statistics fully integrated into your applications, giving you instant access to financial data to automate your critical business processes.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xStatistics.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xStatistics.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteTranscripts",
			"description": "The Transcripts web service provides earning call transcript information from Seeking Alpha. Earnings Calls are a teleconference in which a public company discusses the financial results of a reporting period. Most major U.S. public companies conduct earnings calls and virtually all of these are webcast. The transcripts can be integrated into third party sites and applications. The API uses REST and SOAP calls and responses are formatted in XML.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/xignite.com\/xTranscripts.asmx",
			"baseURL": "http:\/\/xignite.com\/xTranscripts.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteVWAP",
			"description": "This web service provides real-time, intraday and historical VWAP (Volume-Weighted Average Price) information. VWAP is a method of pricing transactions and is used as a benchmark to measure the efficiency of institutional trading or the performance of traders. For examples, it is often used as an indicator for trading performances by pension plans, hedge funds and firms that engage in algorithmic trading. VWAP for a stock is calculated by adding up the dollars traded for every transaction in that stock (price x shares traded) and then dividing by the total shares traded for a specific time period.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/www.xignite.com\/xVWAP.asmx",
			"baseURL": "http:\/\/www.xignite.com\/xVWAP.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		},
		{
			"name": "XigniteWatchLists",
			"description": "The WatchLists web service provides for the management of symbol-based watchlists allowing users access of personal lists. The service allows users to maintain a list of symbols, interest rates, equities and more. Functionality includes standard CRUD operations on watchlists, list items, list rates and list currencies. The API uses REST and SOAP calls and responses are formatted in XML.",
			"image": "http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/xignite-logo.png",
			"humanURL": "http:\/\/xignite.com\/xWatchLists.asmx",
			"baseURL": "http:\/\/xignite.com\/xWatchLists.asmx",
			"tags": [
				"API-Stack"
			],
			"properties": [
			]
		}
	],
	"x-common": [
		{
			"type": "x-case-studies",
			"url": "http:\/\/www.xignite.com\/market-data\/resources\/case-studies\/"
		},
		{
			"type": "x-blog",
			"url": "http:\/\/www.xignite.com\/market-data\/blog\/business-news\/"
		},
		{
			"type": "x-contact-form",
			"url": "http:\/\/www.xignite.com\/market-data\/contact-us"
		},
		{
			"type": "x-portal",
			"url": "http:\/\/www.xignite.com\/developers"
		},
		{
			"type": "x-faq",
			"url": "http:\/\/www.xignite.com\/Support\/FAQs.aspx"
		},
		{
			"type": "x-getting-started",
			"url": "http:\/\/www.xignite.com\/Support\/GettingStarted.aspx"
		},
		{
			"type": "x-github",
			"url": "https:\/\/github.com\/Xignite"
		},
		{
			"type": "x-paid-support-plans",
			"url": "http:\/\/www.xignite.com\/Support\/SupportPlans.aspx"
		},
		{
			"type": "x-blog",
			"url": "http:\/\/www.xignite.com\/market-data\/blog\/tech\/"
		},
		{
			"type": "x-blog-rss-feed",
			"url": "http:\/\/www.xignite.com\/market-data\/feed\/"
		},
		{
			"type": "x-twitter",
			"url": "https:\/\/twitter.com\/xignite"
		},
		{
			"type": "x-videos",
			"url": "http:\/\/www.xignite.com\/market-data\/resources\/videos\/"
		},
		{
			"type": "x-webinars",
			"url": "http:\/\/www.xignite.com\/"
		},
		{
			"type": "x-white-papers",
			"url": "http:\/\/www.xignite.com\/market-data\/resources\/white-papers\/"
		}
	],
	"include": [
		{
			"name": "Parent",
			"url": "http:\/\/theapistack.com\/apis.json"
		}
	],
	"maintainers": [
		{
			"FN": "Kin Lane",
			"x-twitter": "apievangelist",
			"email": "info@apievangelist.com"
		}
	]
}