{
	"name": "Tumblr",
	"description": "Tumblr is a re-envisioning of tumblelogging, a subset of blogging that uses quick, mixed-media posts. The service hopes to do for the tumblelog what services like LiveJournal and Blogger did for the blog. The difference is that its extreme simplicity will make luring users a far easier task than acquiring users for traditional weblogging. Anytime a user sees something interesting online, they can click a quick &ldquo;Share on Tumblr&rdquo; bookmarklet that then tumbles the snippet directly. The result is varied string of media ranging links and text to pictures and videos that takes very little time and effort to maintain.",
	"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/265_logo.png",
	"tags": ["blog",
	"copy",
	"social",
	"stack"],
	"created": "2015-01-01",
	"modified": "2015-01-01",
	"url": "http://theapistack.com/tumblr/apis.json",
	"specificationVersion": "0.14",
	"apis": [{
		"name": "Tumblr",
		"description": "Tumblr, is a microblogging platform, emphasizing ease of use, that allows users to post text, images, videos, links, quotes and audio to their tumblelog, a short-form blog. Users can follow other users, or choose to make their tumblelog private.\nThe Tumblr API is currently in its version 2.0, and provides a RESTful API that takes advantage of a URI structured including version system(such as blog or user), and allows blog owners to use a custom tumblr blog URL or custom domains. &nbsp;\nThe API uses OAuth for user authentication and all responses in JSON, with JSONP also available. &nbsp;The API provides access to Tumblr Blogs in addition to other characteristics like avatars, followers, photos, audio, video and other user related information.",
		"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/265_logo.png",
		"humanURL": "http://www.tumblr.com/",
		"baseURL": "http://www.tumblr.com/",
		"tags": ["blog",
		"copy",
		"social"],
		"properties": [{
			"type": "X-blog",
			"url": "http://staff.tumblr.com/"
		},
		{
			"type": "X-blog-rss-feed",
			"url": "http://staff.tumblr.com/rss"
		},
		{
			"type": "X-portal",
			"url": "https://www.tumblr.com/docs/en/api/v2"
		},
		{
			"type": "X-github",
			"url": "https://github.com/tumblr"
		},
		{
			"type": "X-twitter",
			"url": "https://twitter.com/tumblr"
		},
		{
			"type": "X-webinars",
			"url": "https://www.tumblr.com/"
		}],
		"contact": [{
			"FN": "Tumblr",
			"X-twitter": "https://twitter.com/tumblr"
		}]
	}],
	"maintainers": [{
		"FN": "Kin",
		"X-twitter": "apievangelist",
		"email": "kin@email.com"
	}]
}