{
	"name": "Acuity Scheduling",
	"description": "Easy online appointment scheduling. Helping small businesses offer booking and manage their appointments online since 2006.",
	"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/actuity-scheduling.png",
	"tags": ["mobile",
	"office",
	"scheduling"],
	"created": "2015-01-01",
	"modified": "2015-01-01",
	"url": "http://theapistack.com/acuity-scheduling/apis.json",
	"specificationVersion": "0.14",
	"apis": [{
		"name": "Acuity Appointment Scheduling",
		"description": "Acuity Appointment Scheduling is an online appointment booking service that can be accessed via mobile devices by both users and clients. Clients can book their own appointments or classes online and even pay in advance. Acuity users can accept appointments and payments through their own websites or through the free scheduling pages Acuity provides. They may also create discount codes and gift certificates for appointments through Acuity. Acuity Appointment Scheduling automatically accounts for timezone differences, records appointments in Google, notifies users of new appointments, and sends reminder emails to clients.\n\nAcuity users can easily export data, such as client information and appointment schedules, from the service. Client information that has been collected can be used to create custom forms that will take less time to fill out. Acuity can also generate reports about appointments, revenue, staff, or locations over any time range. Developers can interact with their appointment schedule programmatically via REST API.",
		"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/actuity-scheduling.png",
		"humanURL": "http://acuityscheduling.com/api-docs.php",
		"baseURL": "http://acuityscheduling.com/api-docs.php",
		"tags": ["mobile",
		"office",
		"scheduling"],
		"properties": [{
			"type": "X-portal",
			"url": "https://acuityscheduling.com/api-docs.php"
		},
		{
			"type": "X-twitter",
			"url": "https://twitter.com/AcuitySchedulin"
		},
		{
			"type": "X-webinars",
			"url": "http://acuityscheduling.com/"
		}],
		"contact": [{
			"FN": "Acuity Appointment Scheduling",
			"X-twitter": "https://twitter.com/AcuitySchedulin"
		}]
	}],
	"maintainers": [{
		"FN": "Kin",
		"X-twitter": "apievangelist",
		"email": "kin@email.com"
	}]
}