{
	"name": "Sift Science",
	"description": "<p>Sift Science fights fraud with machine learning. Machine learning teaches a computer to mine data for statistical patterns, and continuously learn and adapt as new data streams in. With simple APIs that take minutes to integrate, an online business can leverage the latest in large-scale machine learning to protect themselves from fraud. Chargebacks, spammers, account takeovers, etc. Online businesses send Sift Science user events, which are mined for identity, behavioral, and network patterns that correspond to past fraud. Sift Science also pools fraud patterns across its network of customers. The network strengthens as more data streams in. Customers can also &ldquo;train their own model&rdquo; and tailor their results via a simple interface.</p>",
	"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/1475_logo.png",
	"tags": ["analytics",
	"monitoring",
	"security",
	"stack",
	"utility"],
	"created": "2014-12-31",
	"modified": "2014-12-31",
	"url": "http://theapistack.com/sift-science/apis.json",
	"specificationVersion": "0.14",
	"apis": [{
		"name": "Sift Science",
		"description": "Sift Science is a company focused on monitoring your website&#039;s traffic to protect it from users intent on malicious activities such as: fraud, credit card chargebacks, money laundering, abuse of referral programs, and general spamming of your site.nnCurrently in private beta, the company offeres both a Java and a REST API that track events on your website. Both integrate into your website much like Google Analytics with the Java API tracking more casual interactions (logins, screen resolutions, IP address) with the REST API documenting more backend operations (user signups, transactions made). The company also offers a Score API which allows you to dynamically call up a JSON document with the current risk assessment of your site.",
		"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/1475_logo.png",
		"humanURL": "https://siftscience.com/docs",
		"baseURL": "https://siftscience.com/docs",
		"tags": ["analytics",
		"monitoring",
		"security",
		"utility"],
		"properties": [{
			"type": "X-blog",
			"url": "https://blog.siftscience.com"
		},
		{
			"type": "X-portal",
			"url": "https://siftscience.com/resources/tutorials/integration-guide.html"
		},
		{
			"type": "X-email",
			"url": "support@siftscience.com"
		},
		{
			"type": "X-twitter",
			"url": "https://twitter.com/siftscience"
		},
		{
			"type": "X-webinars",
			"url": "https://siftscience.com/"
		}],
		"contact": [{
			"FN": "Sift Science",
			"email": "support@siftscience.com",
			"X-twitter": "https://twitter.com/siftscience"
		}]
	}],
	"maintainers": [{
		"FN": "Kin",
		"X-twitter": "apievangelist",
		"email": "kin@email.com"
	}]
}