{
	"name": "Ponoko",
	"description": "<p>Ponoko is an online marketplace &nbsp;creators, digital fabricators, materials suppliers and buyers meet to make 3D printing products. The site host tens of thousands of user generated product designs, that can be customized and printed using 3D printing technology. Using the Ponoko digital making system product designs can be priced instantly online and made locally, as close to the point of consumption as possible. It means goods can be made in the greenest way. Making on demand reduces warehousing and wastage. Plus, making locally emphasizes digital transportation of goods instead of the traditional shipping of physical products. The Ponoko API allows developers to upload and make new products, choosing from the Ponoko materials catalog, and allows ordering of 3D print products.</p>",
	"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/serviceproviders/ponoko-logo.jpg",
	"tags": ["3d-printing",
	"manufacturing",
	"printing",
	"product",
	"sharing",
	"stack"],
	"created": "2014-12-31",
	"modified": "2014-12-31",
	"url": "http://theapistack.com/ponoko/apis.json",
	"specificationVersion": "0.14",
	"apis": [{
		"name": "Ponoko",
		"description": "<p>Ponoko is an online marketplace u00a0creators, digital fabricators, materials suppliers and buyers meet to make 3D printing products.</p>n<p>The site host tens of thousands of user generated product designs, that can be customized and printed using 3D printing technology.</p>n<p>Using the Ponoko digital making system product designs can be priced instantly online and made locally, as close to the point of consumption as possible.</p>n<p>It means goods can be made in the greenest way. Making on demand reduces warehousing and wastage. Plus, making locally emphasizes digital transportation of goods instead of the traditional shipping of physical products.</p>n<p>The Ponoko API allows developers to upload and make new products, choosing from the Ponoko materials catalog, and allows ordering of 3D print products.</p>",
		"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/serviceproviders/ponoko-logo.jpg",
		"humanURL": "http://www.ponoko.com/",
		"baseURL": "http://www.ponoko.com/",
		"tags": ["3d-printing",
		"printing",
		"product",
		"sharing"],
		"properties": [{
			"type": "X-blog",
			"url": "http://blog.ponoko.com/"
		},
		{
			"type": "X-blog-rss-feed",
			"url": "http://feeds.feedburner.com/Ponoko"
		},
		{
			"type": "X-portal",
			"url": "http://www.ponoko.com/app-gateway/api-documentation"
		},
		{
			"type": "X-github",
			"url": "https://github.com/Ponoko"
		},
		{
			"type": "X-twitter",
			"url": "https://twitter.com/ponoko"
		},
		{
			"type": "X-webinars",
			"url": "https://www.ponoko.com/"
		}],
		"contact": [{
			"FN": "Ponoko",
			"X-twitter": "https://twitter.com/ponoko"
		}]
	}],
	"maintainers": [{
		"FN": "Kin",
		"X-twitter": "apievangelist",
		"email": "kin@email.com"
	}]
}